[
    {
      "id": 1,
      "title": "Frederique Constant",
      "description": "Frederique Constant offers not only exceptional timepieces of high quality, but also makes them accessible to watch lovers. Live your passion!",
      "price": 299,
      "image": "https://www.helioswatchstore.com/sites/default/files/na2.jpg",
      "rating": 4.5
    },
    {
      "id": 2,
      "title": "Balmain",
      "description": "Balmain has redefined elegance and class with its fashion-forward design. Their watches speak of luxury and charisma in every cut.",
      "price": 399,
      "image": "https://www.helioswatchstore.com/sites/default/files/balmain-NA.jpg",
      "rating": 4
    },
    {
      "id": 3,
      "title": "Garmin",
      "description": "Today, Garmin is the renowned leader in the aviation, marine, automotive, outdoor, and fitness markets.",
      "price": 599,
      "image": "https://www.helioswatchstore.com/sites/default/files/na.jpg",
      "rating": 3.9
    },
    {
      "id": 4,
      "title": "Tissot T- Sport V8 Chronograph",
      "description": "Taking the prominent spot on our list is this Swiss-made quartz chronograph from Tissot. Tissot, as we all know, is a phenomenal brand with a phenomenal reputation, and the V8 is something they should absolutely be proud of. A classy and sophisticated chronograph with a unique green Tachymeter scale, three Chrono registers, and a luxurious strap that together make this watch one of the best-looking chronographs in the market, for a fraction of a price!",
      "price": 499,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/05/top-10-quartz-watches-Post-3.jpg",
      "rating": 4
    },
    {
      "id": 5,
      "title": "Rado Centrix",
      "description": "The ‘first Swiss watch’ for millions, also the most searched watch on the internet. The ‘black and gold’ Centrix has been every die hard Rado loyalist’s first choice. With its unfazed-minimalistic design, made of ceramic, this watch is perfect for either a formal or casual attire. Additionally, its extremely light weight and comfortable as well.",
      "price": 1099,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/01/Rado-Top-15-Post-4.jpg",
      "rating": 4.2
    },
    {
      "id": 6,
      "title": "Movado Bold",
      "description": "The company markets the Museum Watch, designed by the American designer Nathan George Horwitt in 1947. Influenced by Bauhaus, the watch dial has a very simple design defined by a solitary dot at 12, symbolizing the sun at high noon. It was first made by an American importer of Swiss watches called \"Vacheron & Constantin-LeCoultre Watches Inc.\" (not the Swiss watchmaker Vacheron Constantin),[10] and later produced by Movado.",
      "price": 2099,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/05/top-10-quartz-watches-Post-10.jpg",
      "rating": 4.9
    },
    {
      "id": 7,
      "title": "Casio G-Shock Gravitymaster",
      "description": "In the world of battery-powered timepieces, there are quartz watches, and then there are G-shocks. Annual Calendar, Digital Compass, Shock Resistant world timer with a 10-year guarantee. Is there anything more you could ask for in $2033. The G-Shock has been a game changer for this very reason and Gravitymaster is by far their best and most popular watch in recent times.",
      "price": 899,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/01/Rado-Top-15-Post-4.jpg",
      "rating": 3.9
    },
    {
      "id": 8,
      "title": "Breitling Colt Quartz",
      "description": "In case you didn’t know, Breitling too are masters of the Quartz world with their ‘Superquartz’ technology that’s 10 times more accurate than your average automatic watch and is COSC Certified!.The Breitling Colt Quartz is by far their most handsome offering, featuring a screw-locked crown and a glare-proof sapphire crystal to ensure reliability and readability up to 200 meters into the briny deep. There’s no denying that it’s a great looking watch to own and one that should draw some envious stares wherever you go.",
      "price": 2899,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/05/top-10-quartz-watches-Post-1.jpg",
      "rating": 4.8
    },
    {
      "id": 9,
      "title": "TAG Heuer Formula 1",
      "description": "Should you find yourself behind the wheel, zipping past your opponents and cruising through the finish line, the iconic Formula 1 is the perfect quartz companion. Modeled after the iconic Formula 1 watch of the past, this watch is nostalgia done right. At just under $2599, the Formula 1 is not exactly inexpensive — but if the track is your home away from home, and if you’ve always dreamt of owning a TAG Heuer, it probably is.",
      "price": 2599,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/05/top-10-quartz-watches-Post-5.jpg",
      "rating": 4.5
    },
    {
      "id": 10,
      "title": "Raymond Weil Tango 300",
      "description": "Sports watches are primarily built for comfort, which is why they tend to be wearable day in and day out. In the world of quartz timepieces, they don’t get better than Raymond Weil’s Tango. Launched as the “versatile chronograph”, it vows to never let its wearer down under the sea (as deep as 300m) or when you’re on the racing track, with its super accurate Swiss-made quartz chronograph. Own this and you’re sorted for life.",
      "price": 3999,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/03/Everyday-Watch-Post-14.jpg",
      "rating": 4.1
    },
    {
      "id": 11,
      "title": "Baume & Mercier Classima Quartz",
      "description": "Baume only entered the Quartz arena a year back and their Classima, and it’s been breaking records around the world. And why wouldn’t it!  With its minimalist, clean, and iconic details like the leaf shaped hour and minute hands and Roman numerals, a high-quality stainless steel finish and arguably one of the best-made leather straps you would ever wear for just $1000, it’s a rare find and you should get your hands on one ASAP.",
      "price": 1000,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/05/top-10-quartz-watches-Post-7.jpg",
      "rating": 4.7
    },
    {
      "id": 12,
      "title": "Seiko Premier Kinetic Perpetual",
      "description": "The Japanese quartz watch invasion was so devastating for the luxury watch world that it even made the mighty Rolex build a quartz timepiece. But who fuelled this fire? None other than Seiko. Seiko hasn’t forgotten its faithful movement and keeps reinventing the Quartz even today with all kinds of tech. Their biggest re-invention of the quartz watch has been the ‘Kinetic’ movement – a battery powered watch that gave the wearer the accuracy of a quartz with the feeling of a mechanical movement. The tech is so advanced that when the watch is not being worn, it hibernates and the hands stop moving to conserve energy, which means that this watch literally will last you a lifetime.",
      "price": 2000,
      "image": "https://cdn4.ethoswatches.com/the-watch-guide/wp-content/uploads/2017/05/seiko.jpg",
      "rating": 4.2
    }
  ]